app/controllers/player_controller.rb

  def create
    @player = Player.new(params[:player])
    if @player.save
      @players = Player.all
---
INSERT INTO "players" ("created_at", "name", "score", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Thu, 23 Jan 2014 00:21:57 UTC +00:00], ["name", "I am a name"], ["score", nil], ["updated_at", Thu, 23 Jan 2014 00:21:57 UTC +00:00]]
SELECT "players".* FROM "players"

  def update
    player = Player.find(params[:player][:id])
    new_score = params[:player][:score].to_i + player.score.to_i
    player.update_attributes(score: new_score)

    @players = Player.all
---
SELECT "players".* FROM "players" WHERE "players"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "players" SET "score" = 10, "updated_at" = '2014-01-23 00:22:01.578201' WHERE "players"."id" = 1
SELECT "players".* FROM "players"

  def destroy
    player = Player.find(params[:id])
    player.destroy

    @players = Player.all
---
SELECT "players".* FROM "players" WHERE "players"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "players" WHERE "players"."id" = ?  [["id", 1]]
SELECT "players".* FROM "players"